SELECT
    "Н_УЧЕНИКИ"."ГРУППА","Н_ЛЮДИ"."ИД","Н_ЛЮДИ"."ФАМИЛИЯ","Н_ЛЮДИ"."ИМЯ",
    "Н_ЛЮДИ"."ОТЧЕСТВО","Н_УЧЕНИКИ"."П_ПРКОК_ИД","Н_УЧЕНИКИ"."СОСТОЯНИЕ"
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_УЧЕНИКИ"."НАЧАЛО" = '2012-09-01'
  AND "Н_УЧЕНИКИ"."ПЛАН_ИД" IN (
    SELECT "Н_ПЛАНЫ"."ИД"
    FROM "Н_ПЛАНЫ"
             JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
             JOIN "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" ON "Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
             JOIN "Н_НАПР_СПЕЦ" ON "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД" = "Н_НАПР_СПЕЦ"."ИД"
    WHERE
        "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная'
      AND "Н_НАПР_СПЕЦ"."НАИМЕНОВАНИЕ" = 'Программная инженерия'
);